#pragma once
#include <iostream>

int findExponentOfTwo(int N) {
    // Переменная для хранения показателя степени
    int K = 0;

    // Пока число N делится на 2, увеличиваем показатель степени и делим N на 2
    while (N > 1) {
        if (N % 2 != 0) {
            // Если число N не является степенью 2, то выводим ошибку
            std::cerr << "Введенное число не является степенью числа 2" << std::endl;
            return -1; // Возвращаем -1 как признак ошибки
        }
        N /= 2;
        K++;
    }

    return K;
}

